projects.html
---
layout: default
title: Projects
---

<p>
This is a list of my personal projects. Many are engineering efforts
and some were undertaken for the sake of learning. I feel that all
those listed are notable enough to include for now, but some will be
removed in the future, and more will certainly be added.
</p>

<p>
Several of these projects are not yet completed to my satisfaction,
and I am continuing work on the ones that I consider most valuable.
</p>

<div id="outline-container-orgb1a09ef" class="outline-2">
<h2 id="orgb1a09ef"><a href="https://github.com/asterane/asterane.github.io">This Website</a></h2>
<div class="outline-text-2" id="text-orgb1a09ef">
<p>
A personal homepage, blog, and portfolio website. Written from scratch
to be fast, clean, and responsive. Also see the colophon.
</p>
</div>
</div>

<div id="outline-container-org7ade1e7" class="outline-2">
<h2 id="org7ade1e7"><a href="https://github.com/asterane/processor-design">Processor Design</a></h2>
<div class="outline-text-2" id="text-org7ade1e7">
<p>
Designing a custom sixteen bit central processing unit, and
constructing it out of discrete logic components.
</p>
</div>
</div>

<div id="outline-container-org4234030" class="outline-2">
<h2 id="org4234030"><a href="https://github.com/asterane/the-grid">The Grid</a></h2>
<div class="outline-text-2" id="text-org4234030">
<p>
[Readme forthcoming] Design through full implementation of a
completely custom LED display wall and software to control it,
measuring 12 feet high by 20 feet wide.
</p>
</div>
</div>

<div id="outline-container-orga3bf441" class="outline-2">
<h2 id="orga3bf441"><a href="https://github.com/asterane/analog-design">Analog Circuit Design</a></h2>
<div class="outline-text-2" id="text-orga3bf441">
<p>
Construction of a high fidelity 90 watt audio power amplifier. Also, a
voltage controlled oscillator design for frequency modulation.
</p>
</div>
</div>

<div id="outline-container-orga09410e" class="outline-2">
<h2 id="orga09410e">Real Time Digital Signal Processing</h2>
<div class="outline-text-2" id="text-orga09410e">
<p>
[Repository forthcoming] Creating algorithms to correct audio
distortion from speakers and the environment. Written for processors
and FPGA.
</p>
</div>
</div>

<div id="outline-container-orgb8e6a8c" class="outline-2">
<h2 id="orgb8e6a8c">Raycasting Demonstration</h2>
<div class="outline-text-2" id="text-orgb8e6a8c">
<p>
[Repository forthcoming] Project to create a first person 3D game in
the style of Doom, using Java. Can move around single layer 3D
environment.
</p>
</div>
</div>

<div id="outline-container-orgbfe81d6" class="outline-2">
<h2 id="orgbfe81d6">Set Design</h2>
<div class="outline-text-2" id="text-orgbfe81d6">
<p>
[Repository forthcoming] Design and construction of all sets for
several large theatrical shows. Used computer aided design.
</p>
</div>
</div>

<div id="outline-container-org70b7abd" class="outline-2">
<h2 id="org70b7abd">Robot Design</h2>
<div class="outline-text-2" id="text-org70b7abd">
<p>
[Repository forthcoming] Building the chassis for a custom wheeled
robot using cheap materials, and writing software for it.
</p>
</div>
</div>

<div id="outline-container-orgc1b0840" class="outline-2">
<h2 id="orgc1b0840">Emacs Configuration</h2>
<div class="outline-text-2" id="text-orgc1b0840">
<p>
[Repository forthcoming] My personal Emacs configuration file, with
all the customization I use to do my work from day to day.
</p>
</div>
</div>

<div id="outline-container-orgbb611df" class="outline-2">
<h2 id="orgbb611df">C Exercises</h2>
<div class="outline-text-2" id="text-orgbb611df">
<p>
[Repository forthcoming] Practice programming using the low level C
language, dealing with memory management, and creating efficient
code.
</p>
</div>
</div>

<div id="outline-container-org88d2045" class="outline-2">
<h2 id="org88d2045">Rust Exercises</h2>
<div class="outline-text-2" id="text-org88d2045">
<p>
[Repository forthcoming] Learning the relatively new Rust systems
language and its many features characteristic of higher level
languages.
</p>
</div>
</div>

<div id="outline-container-org198a660" class="outline-2">
<h2 id="org198a660">Python Exercises</h2>
<div class="outline-text-2" id="text-org198a660">
<p>
[Repository forthcoming] Early work learning how to program computers,
as well as later efforts in scripting various tasks.
</p>
</div>
</div>
